Repository: shreenarayan123/OpenChat
Catalog: dj_backend_server/locale/*/LC_MESSAGES/django.po
Languages: ro

source: Displays an inspiring quote
ro: Afișează un citat inspirațional

source: Don't forget to set INSPIRING_QUOTES in settings.py!
ro: Nu uitați să setați INSPIRING_QUOTES în settings.py!

source: Create a new user
ro: Creează utilizator

source: Please note down the username and password to send to the user.
ro: Notează-ți numele de utilizator și parola pentru a le trimite utilizatorului.

source: They will be required to change these credentials upon their first login.
ro: Vor fi obligați să schimbe aceste date de conectare la prima lor autentificare.

source: Error
ro: Eroare

source: Username
ro: Utilizator

source: First name
ro: Nume

source: Last name
ro: Prenume

source: Password
ro: Parola

source: Suggested password (user will change)
ro: Parolă sugerată (utilizatorul o va schimba)

source: Check password
ro: Verifică parola

source: Create user
ro: Creează utilizator

source: New user created.
ro: Utilizator nou creat.

source: User
ro: Utilizator

source: Back to home
ro: Înapoi la pagina principală

source: Error Check
ro: Verificare erori

source: Exception
ro: Excepție

source: Failed At
ro: Eșuat la

source: No errors found.
ro: Nu s-au găsit erori.

source: first
ro: prima

source: previous
ro: precedenta

source: Page
ro: Pagină

source: of
ro: din

source: next
ro: următoarea

source: last
ro: ultima

source: My chatbots
ro: Chatbot-ul meu

source: Number of bots
ro: Număr de boturi

source: Create new chatbot
ro: Creează un chatbot nou

source: Statistics of discussions in the last days
ro: Statistici ale discuțiilor din ultimele zile

source: Data Sources Added Over Time
ro: Surse de Date Adăugate de-a Lungul Timpului

source: Dashboard | OpenChat
ro: Tablou de bord | OpenChat

source: Sign Out
ro: Deconectare

source: Menu Toggle Button
ro: Buton de comutare a meniului

source: Dashboard
ro: Tablou de bord

source: Profile Menu Offcanvas Button
ro: Butonul Offcanvas al Meniului de Profil

source: Login | OpenChat
ro: Autentificare | OpenChat

source: Create an Account ?
ro: Creează un cont ?

source: Register
ro: Înregistrare

source: Try & Share
ro: Încearcă și Distribuie

source: General settings
ro: Setări generale

source: Data & Knowledge
ro: Date și Cunoștințe

source: History
ro: Istoric

source: Errors check
ro: Verificare erori

source: Modify user details
ro: Modifică datele utilizatorului

source: Forget Password
ro: Ai uitat parola

source: Modify your user data
ro: Modifică datele utilizatorului

source: Password and Check password
ro: Parola și Verifică parola

source: do not need to be sent if they are not changing.
ro: nu trebuie trimise dacă nu se schimbă.

source: Update user
ro: Creează utilizator

source: Upload files as sources
ro: Încarcă fișiere ca surse

source: Close
ro: Închide

source: Click to upload or drag & drop
ro: Clic pentru a încărca sau trageți și plasați

source: you can upload up to 5 files, and we will process the first ±100k words
ro: puteți încărca până la 5 fișiere, și vom procesa primele ±100k cuvinte

source: Delete files after sending them for processing.
ro: Șterge fișierele după trimiterea lor pentru procesare.

source: Check this only if you have scanned pages in the PDF document and want them to be sent to OCR services.
ro: Bifați aceasta doar dacă aveți pagini scanate în documentul PDF și doriți să le trimiteți la serviciile OCR.

source: We are accepting PDF/DOCX/XLSX/TXT(CSV/JSON).
ro: Acceptăm PDF/DOCX/XLSX/TXT(CSV/JSON).

source: PDF files can contain both text and images. We will send to OCR.
ro: Fișierele PDF pot conține atât text cât și imagini. Le vom trimite la OCR.

source: You can upload multiple files at once and we will process them in the background.
ro: Puteți încărca mai multe fișiere odată și le vom procesa în fundal.

source: Back
ro: Înapoi

source: Next Step
ro: Pasul Următor

source: Website information
ro: Informații website ✨

source: Please enter a valid website URL, it\
ro: Vă rugăm să introduceți un URL valid de website, acesta\

source: Website url
ro: URL website

source: Let's set up your first chatbot, for free
ro: Să configurăm primul tău chatbot, gratuit

source: And here how we are going to do it:
ro: Și iată cum o să procedăm:

source: You provide the system with data
ro: Tu furnizezi sistemului datele

source: We train our AI on this knowledge
ro: Antrenăm IA cu aceste cunoștințe

source: It might take minutes or hours, depend on how large is your data.
ro: Ar putea dura minute sau ore, în funcție de cât de mari sunt datele tale.

source: You integrate the chatbot on your website
ro: Integrezi chatbot-ul pe site-ul tău web

source: That is it! we will provide you with a Javascript code to put it on your website.
ro: Asta e tot! Îți vom furniza un cod Javascript pentru a-l pune pe site-ul tău.

source: Let's do it!
ro: Hai să o facem!

source: Select your data source
ro: Selectează sursa datelor tale

source: Select the source of your data to train your new chatbot
ro: Selectează sursa datelor tale pentru a antrena noul tău chatbot

source: you can always add new sources later
ro: întotdeauna poți adăuga noi surse mai târziu

source: Please enter a valid website URL, it's important that your website is live and accessible
ro: Te rog să introduci un URL valid al site-ului web, este important ca site-ul tău să fie activ și accesibil

source: Website
ro: URL website

source: We will crawl your website and extract the knowledge automatically.
ro: Vom răsfoi site-ul tău web și vom extrage cunoștințele automat.

source: PDF/DOCX/TXT/JSON/XLSX files
ro: Fișiere PDF/DOCX/TXT/JSON/XLSX

source: We will scan your files and extract knowledge and any information
ro: Vom răsfoi site-ul tău web și vom extrage cunoștințele automat.

source: Provide a link to your codebase and we will extract the knowledge and any information
ro: Vom răsfoi site-ul tău web și vom extrage cunoștințele automat.

source: soon
ro: în curând

source: Automatically extract data from your Confluence from your workspace
ro: Extrage automat datele din Confluence-ul tău din spațiul tău de lucru

source: Automatically extract data from your Notion from your workspace
ro: Extrage automat datele din Notion-ul tău din spațiul tău de lucru

source: GitHub Repo information
ro: Informații website ✨

source: Please provide a valid GitHub repository url.
ro: Vă rugăm să furnizați un URL valid pentru un repository GitHub.

source: Repository url
ro: URL website

source: must have
ro: trebuie să aibă

source: main
ro: principală

source: branch
ro: ramură

source: Your repo is private?
ro: Repozitoriul tău este privat?

source: Upload PDF files as sources
ro: Încarcă fișiere PDF ca surse

source: you can upload up to 5 pdf files, and we will process the first ±100k words
ro: poți încărca până la 5 fișiere pdf, și vom procesa primele ±100k cuvinte

source: Delete PDF files after sending them for processing.
ro: Șterge fișierele PDF după trimiterea lor pentru procesare.

source: Skip and add later
ro: Omite și adaugă mai târziu

source: Just to make sure we are on the same page
ro: Doar pentru a ne asigura că suntem pe aceeași pagină

source: We might not be able to crawl some websites, especially websites that are built using JS (SPA), we are working on adding headless browsing to support all sorts of websites.
ro: S-ar putea să nu putem răsfoi unele site-uri web, în special cele construite folosind JS (SPA). Lucrăm la adăugarea navigării fără cap pentru a suporta toate tipurile de site-uri web.

source: In the meanwhile, Let's do some configurations
ro: Între timp, să facem câteva configurări

source: While we are crawling your website, you can do some configurations on your chatbot
ro: În timp ce răsfoim site-ul tău web, poți face câteva configurări pe chatbot-ul tău

source: What type of character that chatbot must be?
ro: Ce tip de caracter trebuie să aibă chatbot-ul?

source: Choose the preferred bot character, wise & strict character will force the bot to only answer questions that have been seen before, while the Knowledgeable makes the bot a bit more flexible and tries to be creative with answers
ro: Alege caracterul preferat al botului. Un caracter înțelept și strict va forța botul să răspundă doar la întrebările care au fost văzute înainte, în timp ce unul Informat îl face pe bot puțin mai flexibil și încearcă să fie creativ cu răspunsurile

source: Wise & Strict
ro: Înțelept și Strict

source: Only answers questions within the given knowledge.
ro: Răspunde doar la întrebări în cadrul cunoștințelor date.

source: Knowledgeable
ro: Date și Cunoștințe

source: Answers questions within the given knowledge and beyond.
ro: Răspunde la întrebări în cadrul cunoștințelor date și dincolo de acestea.

source: That is it!
ro: Asta este tot!

source: Your chatbot name:
ro: Numele chatbot-ului tău:

source: Open your bot
ro: Deschide-ți botul

source: analytics
ro: Analitice

source: Try it out! ->
ro: Încearcă acum! ->

source: Analytics
ro: Analitice

source: This is your general bot settings such as name and id
ro: Acestea sunt setările generale ale botului tău, precum numele și ID-ul

source: Analytics is coming soon!
ro: Analiticele vor fi disponibile în curând!

source: Unique Visitors
ro: Vizitatori Unici

source: Total Pageviews
ro: Vizualizări Totale de Pagină

source: Bounce Rate
ro: Rata de Respingere

source: Visit Duration
ro: Durata Vizitei

source: data sources
ro: Selectează sursa datelor tale

source: Home
ro: Acasă

source: Data Sources
ro: Sursa de date

source: Data sources
ro: Surse de date

source: Website data sources
ro: Selectează sursa datelor tale

source: with crawled pages
ro: cu pagini răsfoite

source: Documents Data sources
ro: Sursa de date a documentelor

source: Codebase data sources
ro: Selectează sursa datelor tale

source: chat history
ro: Istoric

source: Chat History
ro: Istoric

source: Select a conversation to get started.
ro: Selectează o conversație pentru a începe.

source: Total Messages
ro: Vizualizări Totale de Pagină

source: First Message
ro: Primul Mesaj

source: No chat history available.
ro: Nu este disponibil niciun istoric de chat.

source: Integrations
ro: Integrări

source: View All
ro: Vezi Tot

source: Utility
ro: Utilitate

source: Development
ro: Dezvoltare

source: try & share
ro: Încearcă și Distribuie

source: Try & Share!
ro: Încearcă și Distribuie

source: Here you can try and play with your bot, also you can share it or embed it in your web apps. Anyone with this link will be able to interact with your chatbot
ro: Aici poți să testezi și să te joci cu botul tău, de asemenea îl poți partaja sau încorpora în aplicațiile tale web. Oricine are acest link va putea interacționa cu chatbot-ul tău

source: Share with others!
ro: Partajează cu alții!

source: Embed on your web app as a chat bubble
ro: Încorporează în aplicația ta web ca o bulă de chat

source: Copy the following code into your website head script
ro: Copiază următorul cod în scriptul de head al site-ului tău

source: Embed on your web app as a search box
ro: Încorporează în aplicația ta web ca o casetă de căutare

source: Copy the following code into your website head script. Please read the documentation to see all the options for the search widget.
ro: Copiază următorul cod în scriptul de head al site-ului tău. Te rog să citești documentația pentru a vedea toate opțiunile pentru widget-ul de căutare.

source: general settings
ro: Setări generale

source: General Settings
ro: Setări generale

source: Name
ro: Nume

source: API Token
ro: Token API

source: Custom Context
ro: Context Personalizat

source: You can change your bot initial context / prompt from here. also you can change the bot response language.
ro: Puteți schimba contextul / promptul inițial al botului de aici. De asemenea, puteți schimba limba de răspuns a botului.

source: Manual context
ro: Context manual

source: or choose one of the below
ro: sau alegeți una dintre opțiunile de mai jos

source: Customer Support
ro: Suport Client

source: Search Engine
ro: Motor de Căutare

source: Teacher
ro: Profesor

source: Critical thinker
ro: Gânditor critic

source: Software Engineer
ro: Inginer Software

source: Ghost Writer
ro: Scriitor Fantomă

source: Save Changes
ro: Salvează Modificările

source: Delete the bot
ro: Șterge botul

source: Deleting the bot will delete all the data associated with it.
ro: Ștergerea botului va șterge toate datele asociate cu acesta.

source: Want to add new sources?
ro: întotdeauna poți adăuga noi surse mai târziu

source: Add new data source
ro: Selectează sursa datelor tale

source: When you add a new data source, we will train our AI on this data, the results is that your chatbot should be able to answer questions from this data & knowldge
ro: Când adaugi o nouă sursă de date, vom antrena IA noastră cu aceste date, rezultatul fiind că chatbot-ul tău ar trebui să poată răspunde la întrebări din aceste date și cunoștințe

source: We are working on many other data sources, such as Notion, Confluence, Word Documents and many more.
ro: Lucrăm la multe alte surse de date, cum ar fi Notion, Confluence, Documente Word și multe altele.

source: This part will show your codebase data
ro: Această parte va afișa datele din baza de cod

source: In progress
ro: În desfășurare

source: Completed
ro: Finalizat

source: Re-sync
ro: Re-sincronizează

source: Delete
ro: Șterge

source: Document data sources
ro: Selectează sursa datelor tale

source: All your PDF/DOC/XLS files are in this list.
ro: Toate fișierele tale PDF/DOC/XLS se află în această listă.

source: Bulk Files
ro: Fișiere în bloc

source: upload_file
ro: încarcă_fișier

source: Last update:
ro: Ultima actualizare:

source: files scanned
ro: fișiere scanate

source: Menu
ro: Meniu

source: Download URL
ro: Descarcă URL

source: On
ro: Activ

source: Website:
ro: Site web:

source: pages scanned
ro: pagini scanate

source: Title
ro: Titlu

source: Status
ro: Stare

source: Done
ro: Finalizat

source: person
ro: persoană

source: badge
ro: insignă

source: We are currently in the process of crawling your website to prepare your chatbot. Once the crawling is complete, your chatbot will be ready. To access all data sources, please
ro: În prezent, suntem în procesul de scanare a site-ului tău web pentru a pregăti chatbot-ul tău. Odată ce scanarea este completă, chatbot-ul tău va fi gata. Pentru a accesa toate sursele de date, te rog

source: click here
ro: apasă aici

source: We're sorry,
ro: Ne pare rău,

source: but we're having trouble crawling your website
ro: dar avem probleme în a răsfoi site-ul tău web

source: Please double-check that your website is up and running.
ro: Te rog verifică că site-ul tău web este activ și funcționează.

source: We are done crawling your website! Your chatbot is ready to go with
ro: În timp ce răsfoim site-ul tău web, poți face câteva configurări pe chatbot-ul tău

source: knowledge
ro: Date și Cunoștințe

source: We are currently in the process of processing your PDF files. It may take some time for the bot to ingest all the data. You can
ro: În prezent, suntem în procesul de procesare a fișierelor tale PDF. S-ar putea să dureze ceva timp pentru ca botul să preia toate datele. Poți

source: to open all data sources.
ro: pentru a deschide toate sursele de date.

source: We encountered a problem while training the bot on your PDF files. Our team has been alerted, and we will investigate the issue.
ro: Am întâmpinat o problemă în timpul antrenării botului cu fișierele tale PDF. Echipa noastră a fost alertată, și vom investiga problema.
